apache/mynewt-nimble/nimble/drivers/nrf5x/src/ble_phy_cs.c
/*
 * Licensed to the Apache Software Foundation (ASF) under one
 * or more contributor license agreements.  See the NOTICE file
 * distributed with this work for additional information
 * regarding copyright ownership.  The ASF licenses this file
 * to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance
 * with the License.  You may obtain a copy of the License at
 *
 *  http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing,
 * software distributed under the License is distributed on an
 * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 * KIND, either express or implied.  See the License for the
 * specific language governing permissions and limitations
 * under the License.
 */

#include <stdint.h>
#include <string.h>
#include <assert.h>
#include <hal/nrf_radio.h>
#include <hal/nrf_timer.h>
#include <hal/nrf_rtc.h>
#include "syscfg/syscfg.h"
#include "os/os.h"
#include "os/os_cputime.h"
#include "nimble/ble.h"
#include "controller/ble_phy.h"
#include "controller/ble_ll.h"
#include "nrfx.h"
#include "phy_priv.h"
#include <controller/ble_ll_pdu.h>
#include <mcu/cmsis_nvic.h>
#include <math.h>

#if MYNEWT_VAL(BLE_CHANNEL_SOUNDING)

extern uint8_t g_ble_phy_cs_lock;
extern void nrf_wait_disabled(void);

/* Various radio timings */
/* Radio ramp-up times in usecs (fast mode) */
#define BLE_PHY_T_TXENFAST      (40)
#define BLE_PHY_T_RXENFAST      (40)

#define CSTONE_EXCLUSION_PERIOD_US (10) // XXXX change to 1us

#define TONE_RESULT_COUNT_MAX (5)

#define BLE_PHY_CS_ROLE_INITIATOR (0)
#define BLE_PHY_CS_ROLE_REFLECTOR (1)

static uint32_t g_ble_phy_tx_buf[(BLE_PHY_MAX_PDU_LEN + 3) / 4];
static uint32_t g_ble_phy_rx_buf[(BLE_PHY_MAX_PDU_LEN + 3) / 4];

struct ble_phy_cs_obj
{
    uint32_t prev_radio_isr_handler;
    uint32_t step_anchor_ticks;
    uint8_t phy_state;
    uint8_t phy_mode;
    uint8_t role;
    uint8_t report_sync_results;
    uint8_t report_tone_results;
    struct ble_phy_cs_transmission *prev_transm;
    struct ble_phy_cs_sync_results sync_results;
    struct ble_phy_cs_tone_results tone_results[TONE_RESULT_COUNT_MAX];
    struct ble_phy_cs_subevent_results subevent_results;
};

static struct ble_phy_cs_obj g_ble_phy_cs;

/* delay between EVENTS_READY and start of tx */
const uint16_t txdelay[BLE_PHY_NUM_MODE] = {
    [BLE_PHY_MODE_1M] = 1, /* ~1.6us */
};
/* delay between EVENTS_ADDRESS and txd access address  */
const uint16_t txaddrdelay_ns[BLE_PHY_NUM_MODE] = {
    [BLE_PHY_MODE_1M] = 3200, /* ~3.2us */
};
/* delay between rxd access address (w/ TERM1 for coded) and EVENTS_ADDRESS */
const uint16_t rxaddrdelay_ns[BLE_PHY_NUM_MODE] = {
    [BLE_PHY_MODE_1M] = 9200, /* ~9.2us */
};

#if MYNEWT_VAL(BLE_PHY_CS_USE_PCT_CORRECTION)

#define LUT_SIZE 256
#define FULL_LUT_SIZE (4 * LUT_SIZE)

/* LUT used for correction of the circuit delays. Must be calibrated per device.
 * The values (-32768, 32767) corresponds to <-2π, 2π).
 */
static int16_t pct_angle_correction_lut[80] = MYNEWT_VAL(BLE_PHY_CS_PCT_CORRECTION_PER_CHANNEL);

/* sin approximation for <0, π/2> angles */
static const int16_t sin0_pi2_table[LUT_SIZE] = {
    0, 202, 404, 605, 807, 1009, 1211, 1412,
    1614, 1816, 2017, 2219, 2420, 2621, 2822, 3023,
    3224, 3425, 3626, 3826, 4027, 4227, 4427, 4627,
    4827, 5026, 5226, 5425, 5624, 5822, 6021, 6219,
    6417, 6615, 6813, 7010, 7207, 7404, 7600, 7796,
    7992, 8188, 8383, 8578, 8773, 8967, 9161, 9355,
    9548, 9741, 9933, 10126, 10317, 10509, 10700, 10890,
    11080, 11270, 11459, 11648, 11837, 12025, 12212, 12399,
    12586, 12772, 12958, 13143, 13328, 13512, 13695, 13878,
    14061, 14243, 14425, 14606, 14786, 14966, 15145, 15324,
    15502, 15679, 15856, 16033, 16208, 16383, 16558, 16732,
    16905, 17078, 17250, 17421, 17592, 17761, 17931, 18099,
    18267, 18434, 18601, 18767, 18932, 19096, 19260, 19423,
    19585, 19747, 19907, 20067, 20226, 20385, 20542, 20699,
    20855, 21011, 21165, 21319, 21472, 21624, 21775, 21925,
    22075, 22224, 22372, 22519, 22665, 22810, 22955, 23098,
    23241, 23383, 23524, 23664, 23803, 23941, 24079, 24215,
    24351, 24485, 24619, 24752, 24883, 25014, 25144, 25273,
    25401, 25528, 25654, 25779, 25903, 26026, 26149, 26270,
    26390, 26509, 26627, 26744, 26860, 26976, 27090, 27203,
    27315, 27426, 27536, 27644, 27752, 27859, 27965, 28069,
    28173, 28276, 28377, 28477, 28577, 28675, 28772, 28868,
    28963, 29057, 29150, 29241, 29332, 29421, 29510, 29597,
    29683, 29768, 29851, 29934, 30016, 30096, 30175, 30253,
    30330, 30406, 30481, 30554, 30627, 30698, 30768, 30837,
    30904, 30971, 31036, 31100, 31163, 31225, 31286, 31345,
    31403, 31460, 31516, 31571, 31624, 31676, 31728, 31777,
    31826, 31873, 31920, 31965, 32008, 32051, 32092, 32132,
    32171, 32209, 32246, 32281, 32315, 32348, 32379, 32410,
    32439, 32467, 32493, 32519, 32543, 32566, 32587, 32608,
    32627, 32645, 32662, 32678, 32692, 32705, 32717, 32727,
    32737, 32745, 32751, 32757, 32761, 32765, 32766, 32767,
};

static inline int16_t
sin_rad(int32_t angle)
{
    uint32_t index;
    int16_t sign = 1;

    angle %= FULL_LUT_SIZE;

    if (angle < 0) angle += FULL_LUT_SIZE;

    if (angle < LUT_SIZE) {
        /* 0..π/2, already a good angle */
    } else if (angle < 2 * LUT_SIZE) {
        /* π/2..π */
        angle = 2 * LUT_SIZE - angle;
    } else if (angle < 3 * LUT_SIZE) {
        /* π..3π/2 */
        angle -= 2 * LUT_SIZE;
        sign = -1;
    } else {
        /* 3π/2..2π */
        angle = FULL_LUT_SIZE - angle;
        sign = -1;
    }

    index = ((uint32_t)angle * (LUT_SIZE - 1)) / LUT_SIZE;

    return sign * sin0_pi2_table[index];
}

static inline int16_t
cos_rad(int32_t angle)
{
    /* cos(x) = sin(x + π/2) */
    return sin_rad(angle + LUT_SIZE);
}

static inline void
ble_phy_cs_pct_correct_ciruit_delay(int16_t *PCT_I16, int16_t *PCT_Q16, uint8_t channel)
{
    int16_t I16, Q16;
    int32_t I_corr, Q_corr;
    int32_t angle;
    int16_t cos_phi, sin_phi;

    I16 = *PCT_I16;
    Q16 = *PCT_Q16;

    /* Angle is Q1.31 */
    angle = pct_angle_correction_lut[channel];

    /* angle_lut_idx = (angle/2^15) * FULL_LUT_SIZE
     * Q1.31 * Q0.11 = Q1.42, so we have to >> 11 (out of 15) before
     * multiplication to get max precision Q1.31. After dividing by
     * remaining >> 4 we end up with Q1.17.
     */
    angle = ((angle >> 11) * FULL_LUT_SIZE) >> 4;

