apache/mynewt-nimble/nimble/drivers/nrf5x/src/ble_phy_cs.c
    /* Because of the modulo 2e10 the result is Q1.10 */
    angle = angle % FULL_LUT_SIZE;
    if (angle < 0) angle += FULL_LUT_SIZE;

    /* Read sin/cos from LUT */
    cos_phi = cos_rad(angle);
    sin_phi = sin_rad(angle);

    /* PCT correction. I16, Q16, cos_phi and sin_phi are formatted in Q1.15.
     * The multiplication results in Q1.30 format, so it should be scaled
     * back in the last step.
     */
    I_corr = (int32_t)I16 * cos_phi + (int32_t)Q16 * sin_phi;
    Q_corr = -(int32_t)I16 * sin_phi + (int32_t)Q16 * cos_phi;

    *PCT_I16 = (int16_t)(I_corr >> 15);
    *PCT_Q16 = (int16_t)(Q_corr >> 15);
}
#endif /* BLE_PHY_CS_USE_PCT_CORRECTION */

static inline void
ble_phy_cs_rtt_set(uint8_t *rtt_segments)
{
    if (rtt_segments == NULL) {
        NRF_RADIO->RTT.SEGMENT01 = 0;
        NRF_RADIO->RTT.SEGMENT23 = 0;
        NRF_RADIO->RTT.SEGMENT45 = 0;
        NRF_RADIO->RTT.SEGMENT67 = 0;
    } else {
        NRF_RADIO->RTT.SEGMENT01 = rtt_segments[0];
        NRF_RADIO->RTT.SEGMENT23 = rtt_segments[1];
        NRF_RADIO->RTT.SEGMENT45 = rtt_segments[2];
        NRF_RADIO->RTT.SEGMENT67 = rtt_segments[3];
    }
}

static inline int16_t
ble_phy_cs_ffoest_get(void)
{
    return  ((int16_t)(NRF_RADIO->CSTONES.FFOEST << 4)) >> 4;
}

static int
ble_phy_cs_radio_timer_start(uint32_t cputime, uint8_t rem_us, bool tx)
{
    uint32_t next_cc;
    uint32_t cur_cc;
    uint32_t cntr;
    uint32_t delta;
    uint32_t anchor;
    int radio_rem;
    int rem_us_corr;

    /* Calculate rem_us for radio and FEM enable. The result may be a negative
     * value, but we'll adjust later.
     */
    anchor = rem_us;
    if (tx) {
        radio_rem = anchor - BLE_PHY_T_TXENFAST - txdelay[g_ble_phy_cs.phy_mode];
    } else {
        radio_rem = anchor - BLE_PHY_T_RXENFAST;
    }

    /* We need to adjust rem_us values, so they are >=1 for TIMER10 compare
     * event to be triggered.
     */
    if (radio_rem <= -30) {
        /* rem_us is -60..-30 */
        cputime -= 2;
        rem_us_corr = 61;
    } else {
        /* rem_us is -29..0 */
        cputime -= 1;
        rem_us_corr = 30;
    }

    /*
     * Can we set the RTC compare to start TIMER0? We can do it if:
     *      a) Current compare value is not N+1 or N+2 ticks from current
     *      counter.
     *      b) The value we want to set is not at least N+2 from current
     *      counter.
     *
     * NOTE: since the counter can tick 1 while we do these calculations we
     * need to account for it.
     */
    next_cc = cputime & 0xffffff;
    cur_cc = NRF_RTC0->CC[0];
    cntr = NRF_RTC0->COUNTER;

    delta = (cur_cc - cntr) & 0xffffff;
    if ((delta <= 3) && (delta != 0)) {
        BLE_PHY_CS_ASSERT(0);
        return -1;
    }
    delta = (next_cc - cntr) & 0xffffff;
    if ((delta & 0x800000) || (delta < 3)) {
        BLE_PHY_CS_ASSERT(0);
        return -1;
    }

    /* Clear and set TIMER0 to fire off at proper time */
    nrf_timer_task_trigger(NRF_TIMER10, NRF_TIMER_TASK_CLEAR);
    g_ble_phy_cs.step_anchor_ticks = anchor + rem_us_corr;

    /* Set RTC compare to start TIMER0 */
    NRF_RTC0->EVENTS_COMPARE[0] = 0;
    nrf_rtc_cc_set(NRF_RTC0, 0, next_cc);
    nrf_rtc_event_enable(NRF_RTC0, RTC_EVTENSET_COMPARE0_Msk);

    phy_ppi_rtc0_compare0_to_timer0_start_enable();

    return 0;
}

static inline int
ble_phy_cs_channel_set(uint8_t chan)
{
    assert(!(chan <= 1 || (23 <= chan && chan <= 25) || 77 <= chan));

    /* Check for valid channel range */
    if (chan <= 1 || (23 <= chan && chan <= 25) || 77 <= chan) {
        return BLE_PHY_ERR_INV_PARAM;
    }

    if (NRF_RADIO->FREQUENCY != 2 + chan) {
        NRF_RADIO->FREQUENCY = 2 + chan;
    }

    return 0;
}

static inline void
ble_phy_cs_tune_set(void)
{
    NRF_RADIO->CSTONES.FFOIN = RADIO_CSTONES_FFOIN_ResetValue;
    NRF_RADIO->CSTONES.FFOSOURCE = RADIO_CSTONES_FFOSOURCE_ResetValue;
    NRF_RADIO->CSTONES.PHASESHIFT = 0;
    RADIO_FREQFINETUNE = MYNEWT_VAL(BLE_PHY_CS_FREQFINETUNE) & 0x1FFFUL;
}

static inline void
ble_phy_cs_tone_configure(uint32_t duration_usecs, uint8_t tone_mode)
{
    uint8_t numsamples;

    assert(duration_usecs <= 80);
    numsamples = (duration_usecs - 2 * CSTONE_EXCLUSION_PERIOD_US) * 160 / 80;
    NRF_RADIO->CSTONES.NUMSAMPLES = numsamples;
    NRF_RADIO->CSTONES.NUMSAMPLESCOEFF = (1 << 20) / numsamples;

    if (tone_mode == BLE_PHY_CS_TONE_MODE_PM) {
        NRF_RADIO->CSTONES.DOWNSAMPLE = 1;
        NRF_RADIO->CSTONES.MODE = RADIO_CSTONES_MODE_TPM_Msk | RADIO_CSTONES_MODE_TFM_Msk;
    } else {
        NRF_RADIO->CSTONES.MODE = RADIO_CSTONES_MODE_TFM_Msk;
    }
}

static void
ble_phy_cs_disable(void)
{
#ifdef NRF54L_SERIES
    nrf_timer_task_trigger(NRF_TIMER10, NRF_TIMER_TASK_STOP);
#endif
    phy_ppi_timer0_compare3_to_radio_disable_disable();
    phy_ppi_timer0_compare2_to_radio_start_disable();
    phy_ppi_timer0_compare4_to_radio_cstonesstart_disable();
    phy_ppi_cs_mode_disable();

    nrf_timer_task_trigger(NRF_TIMER10, NRF_TIMER_TASK_STOP);
    phy_ppi_timer0_compare0_to_radio_txen_disable();
    phy_ppi_timer0_compare1_to_radio_rxen_disable();
    phy_ppi_rtc0_compare0_to_timer0_start_disable();
    phy_ppi_timer00_radio_address_to_capture_disable();
    ble_phy_disable();

    ble_phy_transition_set(BLE_PHY_TRANSITION_NONE, 0);

    NRF_RADIO->CSTONES.MODE = 0;
    NRF_RADIO->RTT.CONFIG = 0;

    /* Configure back the registers */
    NRF_RADIO->CRCCNF = (RADIO_CRCCNF_SKIPADDR_Skip << RADIO_CRCCNF_SKIPADDR_Pos) | RADIO_CRCCNF_LEN_Three;
    NRF_RADIO->PCNF0 = NRF_PCNF0;
    NRF_RADIO->PCNF1 = NRF_MAXLEN |
                       (RADIO_PCNF1_ENDIAN_Little <<  RADIO_PCNF1_ENDIAN_Pos) |
                       (NRF_BALEN << RADIO_PCNF1_BALEN_Pos) |
                       RADIO_PCNF1_WHITEEN_Msk;
    NRF_RADIO->RXADDRESSES  = (1 << 0);

    if (g_ble_phy_cs.prev_radio_isr_handler != 0) {
        NVIC_SetVector(RADIO_IRQn, (uint32_t)g_ble_phy_cs.prev_radio_isr_handler);
    }

    g_ble_phy_cs_lock = 0;
}

static void
ble_phy_cs_subevent_end(int status)
{
    ble_phy_cs_disable();
    g_ble_phy_cs.subevent_results.status = status;
    ble_ll_cs_subevent_end(&g_ble_phy_cs.subevent_results);
}

static inline uint32_t
ble_phy_cs_calc_tone_chain_offset(struct ble_phy_cs_transmission *first_tone)
{
    struct ble_phy_cs_transmission *t;
    uint32_t offset_us = 0;

