apache/mynewt-nimble/nimble/drivers/nrf5x/src/ble_phy_cs.c
    t = first_tone;
    while (t && t->mode == BLE_PHY_CS_TRANSM_MODE_TONE) {
        offset_us += t->duration_usecs;
        offset_us += t->end_tifs;
        t = t->next;
    }

    return offset_us;
}

static inline void
ble_phy_cs_radio_events_clear(void)
{
    NRF_RADIO->EVENTS_PHYEND = 0;
    NRF_RADIO->EVENTS_READY = 0;
    NRF_RADIO->EVENTS_TXREADY = 0;
    NRF_RADIO->EVENTS_RXREADY = 0;
    NRF_RADIO->EVENTS_ADDRESS = 0;
    NRF_RADIO->EVENTS_END = 0;
    NRF_RADIO->EVENTS_DISABLED = 0;
    RADIO_EVENTS_CSTONESEND = 0;
    NRF_TIMER10->EVENTS_COMPARE[3] = 0;
}

static int
ble_phy_cs_schedule_step(uint32_t anchor_us, struct ble_phy_cs_transmission *next_transm,
                         uint8_t role)
{
    struct ble_phy_cs_transmission *t = next_transm;
    struct ble_phy_cs_transmission *next;
    uint32_t start_us;
    uint32_t offset_us = 0;
    uint32_t end_us = anchor_us;
    uint32_t total_duration;
    uint8_t current_phase = 0xFF;

    g_ble_phy_cs.report_sync_results = 0;
    g_ble_phy_cs.report_tone_results = 0;
    NRF_RADIO->SHORTS = 0;
    nrf_radio_int_enable(NRF_RADIO, RADIO_INTENSET_DISABLED_Msk);
    ble_phy_cs_rtt_set(NULL);
    ble_phy_cs_channel_set(t->channel);
    nrf_timer_cc_set(NRF_TIMER10, 2, 0xffffffff);
    nrf_timer_cc_set(NRF_TIMER10, 3, 0xffffffff);
    nrf_timer_cc_set(NRF_TIMER10, 4, 0xffffffff);
    nrf_timer_cc_set(NRF_TIMER10, 5, 0xffffffff);

    while (t) {
        start_us = anchor_us + offset_us;

        /* Detect if TX or RX phase */
        if (t->is_tx != current_phase) {
            if (t->is_tx == 1) {
                /* Schedule TXEN */
                NRF_TIMER10->EVENTS_COMPARE[0] = 0;
                nrf_timer_cc_set(NRF_TIMER10, 0, start_us - BLE_PHY_T_TXENFAST - txdelay[g_ble_phy_cs.phy_mode]);
                phy_ppi_timer0_compare0_to_radio_txen_enable();
            } else {
                /* Schedule RXEN */
                NRF_TIMER10->EVENTS_COMPARE[1] = 0;
                nrf_timer_cc_set(NRF_TIMER10, 1, start_us - BLE_PHY_T_RXENFAST);
                phy_ppi_timer0_compare1_to_radio_rxen_enable();
            }

            current_phase = t->is_tx;
        }

        /* Schedule CS_SYNC TX or RX */
        if (t->mode == BLE_PHY_CS_TRANSM_MODE_SYNC) {
            phy_ppi_timer00_radio_address_to_capture_enable();
            g_ble_phy_cs.report_sync_results = 1;
            if (t->is_tx) {
                /* TX SYNC */
                NRF_RADIO->BASE0 = (t->aa << 8);
                NRF_RADIO->PREFIX0 = (NRF_RADIO->PREFIX0 & 0xFFFFFF00) | (t->aa >> 24);
                NRF_RADIO->PACKETPTR = (uint32_t)&g_ble_phy_tx_buf[0];
                /* Set the CS trailer */
                if (NRF_RADIO->PREFIX0 & 0x80) {
                    g_ble_phy_tx_buf[0] = 0b10101010;
                } else {
                    g_ble_phy_tx_buf[0] = 0b01010101;
                }
                /* Schedule RADIO START for TX */
                nrf_timer_cc_set(NRF_TIMER10, 2, start_us);
                phy_ppi_timer0_compare2_to_radio_start_enable();
            } else {
                /* RX SYNC */
                NRF_RADIO->BASE1 = (t->aa << 8);
                NRF_RADIO->PREFIX0 = (NRF_RADIO->PREFIX0 & 0xFFFF00FF) | (((t->aa >> 24) & 0xFF) << 8);
                NRF_RADIO->PACKETPTR = (uint32_t)&g_ble_phy_rx_buf[0];
                /* Schedule RADIO START for RX */
                nrf_timer_cc_set(NRF_TIMER10, 6, start_us);
                phy_ppi_timer0_compare2_to_radio_start_enable();
            }

            end_us = start_us + t->duration_usecs;
            offset_us += t->duration_usecs + t->end_tifs;
            g_ble_phy_cs.prev_transm = t;
            t = t->next;
        } else if (t->mode == BLE_PHY_CS_TRANSM_MODE_TONE) {
            g_ble_phy_cs.report_tone_results = 1;
            total_duration = t->duration_usecs;
            next = t->next;
            if (next && next->is_tx == t->is_tx && next->mode == t->mode) {
                total_duration += t->end_tifs + next->duration_usecs;
                offset_us += next->end_tifs;
                g_ble_phy_cs.prev_transm = next;
                next = next->next;
            } else {
                g_ble_phy_cs.prev_transm = t;
            }
            offset_us += total_duration + t->end_tifs;
            end_us = start_us + total_duration;

            if (t->is_tx) {
                if (t->tone_mode == BLE_PHY_CS_TONE_MODE_PM) {
                    NRF_RADIO->CSTONES.MODE = RADIO_CSTONES_MODE_TPM_Msk | RADIO_CSTONES_MODE_TFM_Msk;
                } else {
                    NRF_RADIO->CSTONES.MODE = RADIO_CSTONES_MODE_TFM_Msk;
                }
            } else {
                ble_phy_cs_tone_configure(t->duration_usecs, t->tone_mode);
                /* Schedule CSTONESSTART for RX */
                nrf_timer_cc_set(NRF_TIMER10, 4, start_us + CSTONE_EXCLUSION_PERIOD_US);
                phy_ppi_timer0_compare4_to_radio_cstonesstart_enable();
            }

            t = next;
        }

        /* Schedule radio disable if the end of the step */
        if (t == NULL || (t->is_tx != current_phase &&
            ((g_ble_phy_cs.role == BLE_PHY_CS_ROLE_INITIATOR && current_phase == 0) ||
             (g_ble_phy_cs.role == BLE_PHY_CS_ROLE_REFLECTOR && current_phase == 1)))) {
            nrf_timer_cc_set(NRF_TIMER10, 3, end_us + 20);
            phy_ppi_timer0_compare3_to_radio_disable_enable();
            g_ble_phy_cs.step_anchor_ticks = end_us + g_ble_phy_cs.prev_transm->end_tifs;
            break;
        }
    }

    return 0;
}

static uint32_t
ticks00_to_ns(uint32_t ticks) {
    return (uint32_t)(((uint64_t)ticks * 1000000000ULL) / 128000000ULL);
}

static void
ble_phy_cs_isr(void)
{
    int rc = 0;
    struct ble_phy_cs_transmission *prev_transm = g_ble_phy_cs.prev_transm;
    struct ble_phy_cs_transmission *next_transm = NULL;
    struct ble_phy_cs_tone_results *tone_result = NULL;
    struct ble_phy_cs_sync_results *sync_result = NULL;
    uint32_t irq00_en;
    uint32_t pct16_reg;
    uint32_t tod_ticks00, toa_ticks00;
    int16_t I16, Q16;
    int16_t measured_freq_offset;
    uint8_t last_half_step;
    uint8_t i;

