apache/mynewt-nimble/nimble/drivers/nrf5x/src/ble_phy_cs.c
    os_trace_isr_enter();

    irq00_en = NRF_RADIO->INTENSET00;

    /* Disable PPI */
    phy_ppi_timer0_compare3_to_radio_disable_disable();
    phy_ppi_rtc0_compare0_to_timer0_start_disable();
    phy_ppi_timer0_compare2_to_radio_start_disable();
    phy_ppi_timer0_compare0_to_radio_txen_disable();
    phy_ppi_timer0_compare1_to_radio_rxen_disable();
    phy_ppi_timer0_compare4_to_radio_cstonesstart_disable();

    /* Make sure all interrupts are disabled */
    NRF_RADIO->INTENCLR00 = NRF_RADIO_IRQ_MASK_ALL;
    RADIO_INTENCLR01 = RADIO_INTENCLR01_CSTONESEND_Msk;
    NRF_TIMER10->INTENCLR = TIMER_INTENSET_COMPARE3_Msk;
    NRF_RADIO->SHORTS = 0;

    BLE_LL_ASSERT((irq00_en & RADIO_INTENSET00_DISABLED_Msk) && NRF_RADIO->EVENTS_DISABLED);

    assert(prev_transm != NULL);

    next_transm = prev_transm->next;

    if(g_ble_phy_cs.report_sync_results) {
        if (NRF_RADIO->EVENTS_ADDRESS == 0) {
            /* Out of sync */
            ble_phy_cs_subevent_end(BLE_PHY_CS_STATUS_SYNC_LOST);
            return;
        }

        sync_result = &g_ble_phy_cs.sync_results;

        if (g_ble_phy_cs.role == BLE_PHY_CS_ROLE_INITIATOR) {
            tod_ticks00 = NRF_TIMER00->CC[0];
            toa_ticks00 = NRF_TIMER00->CC[1];
        } else {
            toa_ticks00 = NRF_TIMER00->CC[0];
            tod_ticks00 = NRF_TIMER00->CC[1];
        }
        sync_result->time_of_departure_ns = ticks00_to_ns(tod_ticks00) +
                txaddrdelay_ns[g_ble_phy_cs.phy_mode];
        sync_result->time_of_arrival_ns = ticks00_to_ns(toa_ticks00) -
                rxaddrdelay_ns[g_ble_phy_cs.phy_mode];
    }

    ble_phy_cs_radio_events_clear();

    if(g_ble_phy_cs.report_tone_results) {
        pct16_reg = NRF_RADIO->CSTONES.PCT16;
        I16 = (int16_t)(pct16_reg & 0xFFFF);
        Q16 = (int16_t)((pct16_reg >> 16) & 0xFFFF);

        measured_freq_offset = ble_phy_cs_ffoest_get();
//            ble_phy_cs_pct_correct_ciruit_delay(&I16, &Q16, prev_transm->channel);

        tone_result = &g_ble_phy_cs.tone_results[0];
        tone_result->I16 = I16;
        tone_result->Q16 = Q16;
        tone_result->measured_freq_offset = measured_freq_offset;
    }

    /* The step has been completed. */
    rc = ble_ll_cs_step_end(prev_transm, tone_result, sync_result);
    if (rc) {
        ble_phy_cs_subevent_end(BLE_PHY_CS_STATUS_SYNC_LOST);
    }

    if (next_transm) {
        ble_phy_cs_schedule_step(g_ble_phy_cs.step_anchor_ticks, next_transm, g_ble_phy_cs.role);
    } else {
        ble_phy_cs_subevent_end(BLE_PHY_CS_STATUS_COMPLETE);
    }

    os_trace_isr_exit();
}

int
ble_phy_cs_subevent_start(struct ble_phy_cs_transmission *transm,
                          uint32_t cputime, uint8_t rem_usecs)
{
    int rc;

    g_ble_phy_cs_lock = 1;

    /* Disable all PPI */
    nrf_wait_disabled();
    phy_ppi_timer0_compare3_to_radio_disable_disable();
    phy_ppi_radio_bcmatch_to_aar_start_disable();
    phy_ppi_radio_address_to_ccm_crypt_disable();
    phy_ppi_timer0_compare2_to_radio_start_disable();
    phy_ppi_timer0_compare0_to_radio_txen_disable();
    phy_ppi_timer0_compare0_to_radio_rxen_disable();
    phy_ppi_timer0_compare1_to_radio_rxen_disable();
    phy_ppi_timer0_compare4_to_radio_cstonesstart_disable();

    g_ble_phy_cs.phy_mode = BLE_PHY_MODE_1M;
    g_ble_phy_cs.prev_transm = NULL;

    g_ble_phy_cs.role = transm->is_tx ? BLE_PHY_CS_ROLE_INITIATOR : BLE_PHY_CS_ROLE_REFLECTOR;

    phy_ppi_cs_mode_enable();

    /* CS SYNC packet has no PDU or CRC */
    NRF_RADIO->CRCCNF = 0;
    /* CS_SYNC needs only PAYLOAD field, so do not transmit S0, LENGTH and S1 fields.
     * Set the preambule length to 8 bits for LE 1M.
     * Set the S1 length to 4 bits to fit a CS trailer.
     */
    NRF_RADIO->PCNF0 = (RADIO_PCNF0_PLEN_8bit << RADIO_PCNF0_PLEN_Pos)
                        | (4 << RADIO_PCNF0_S1LEN_Pos);
    /* Disable whitening */
    NRF_RADIO->PCNF1 = (NRF_BALEN << RADIO_PCNF1_BALEN_Pos);
    NRF_RADIO->RXADDRESSES  = (1 << 1);

    NRF_RADIO->RTT.CONFIG = (RADIO_RTT_CONFIG_EN_Enabled << RADIO_RTT_CONFIG_EN_Pos) |
        ((g_ble_phy_cs.role == BLE_PHY_CS_ROLE_INITIATOR) ?
        RADIO_RTT_CONFIG_ROLE_Initiator << RADIO_RTT_CONFIG_ROLE_Pos :
        RADIO_RTT_CONFIG_ROLE_Reflector << RADIO_RTT_CONFIG_ROLE_Pos);

    NRF_RADIO->SHORTS = 0;

    ble_phy_cs_tune_set();

    /* Make sure all interrupts are disabled */
    nrf_radio_int_disable(NRF_RADIO, NRF_RADIO_IRQ_MASK_ALL);

    /* Set interrupt handler for Channel Sounding api */
    g_ble_phy_cs.prev_radio_isr_handler = NVIC_GetVector(RADIO_IRQn);
    NVIC_SetVector(RADIO_IRQn, (uint32_t)ble_phy_cs_isr);

    /* Clear events */
    ble_phy_cs_radio_events_clear();

    nrf_timer_task_trigger(NRF_TIMER10, NRF_TIMER_TASK_STOP);
    nrf_timer_task_trigger(NRF_TIMER10, NRF_TIMER_TASK_CLEAR);
#if 1
    nrf_timer_task_trigger(NRF_TIMER00, NRF_TIMER_TASK_STOP);
    nrf_timer_task_trigger(NRF_TIMER00, NRF_TIMER_TASK_CLEAR);
    NRF_TIMER00->BITMODE = 3;    /* 32-bit timer */
    NRF_TIMER00->MODE = 0;       /* Timer mode */
    NRF_TIMER00->PRESCALER = 0;  /* gives us 128 MHz */
    nrf_timer_task_trigger(NRF_TIMER00, NRF_TIMER_TASK_START);
#endif

    phy_ppi_debug_enable();

    rc = ble_phy_cs_radio_timer_start(cputime, rem_usecs, transm->is_tx);
    if (rc) {
        ble_phy_cs_disable();
        return 1;
    }

    rc = ble_phy_cs_schedule_step(g_ble_phy_cs.step_anchor_ticks, transm, g_ble_phy_cs.role);
    if (rc) {
        ble_phy_cs_disable();
        return 1;
    }

    return 0;
}
#endif
